export class parts{
  // frt_male = ['头部','眼部','眼部','耳朵','耳朵','鼻子','嘴巴','颈部','胸部','腹部','髋部','阴部','肩部','肩部','上臂','上臂','肘部','肘部','前臂','前臂','腕部','腕部','手掌','手掌','大腿','大腿','膝盖','膝盖','小腿','小腿','脚腕','脚腕','足部','足部'];
  // frt_female = ['头部','眼部','眼部','耳朵','耳朵','鼻子','嘴巴','颈部','胸部','乳房','腹部','髋部','阴部','肩部','肩部','上臂','上臂','肘部','肘部','前臂','前臂','腕部','腕部','手掌','手掌','大腿','大腿','膝盖','膝盖','小腿','小腿','脚腕','脚腕','足部','足部'];
  // bck = ['头部','颈部','背部','腰部','臀部','肩部','肩部','上臂','上臂','肘部','肘部','前臂','前臂','腕部','腕部','手背','手背','大腿','大腿','膝盖','膝盖','小腿','小腿','脚踝','脚踝','脚底','脚底','足部','足部'];
  frt_male = ['bp41','bp46','bp33','bp33','bp32','bp32','bp27','bp25','bp45','bp24','bp36','bp37','bp38','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp26','bp26','bp26','bp26','bp26','bp26','bp26','bp26','bp26','bp26'];
  frt_female = ['bp71','bp57','bp57','bp56','bp56','bp51','bp49','bp70','bp48','bp54','bp60','bp61','bp62','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp50','bp50','bp50','bp50','bp50','bp50','bp50','bp50','bp50','bp50',"bp65"];
  bck_male = ['bp46','bp45','bp35','bp35','bp31','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp44','bp26','bp26','bp26','bp26','bp26','bp26','bp26','bp26','bp26','bp26','bp26','bp26'];
  bck_female = ['bp71','bp70','bp59','bp59','bp55','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp69','bp50','bp50','bp50','bp50','bp50','bp50','bp50','bp50','bp50','bp50','bp50','bp50'];
  frt_child = ['bp10','bp10','bp9','bp9','bp4','bp2','bp21','bp1','bp13','','bp14','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp15','bp15','bp15','bp15','bp15','bp15','bp15','bp15','bp15','bp15','bp17','bp22'];
  bck_child = ['bp22','bp21','bp12','bp12','bp8','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp20','bp15','bp15','bp15','bp15','bp15','bp15','bp15','bp15','bp15','bp15','bp15','bp15'];
}
