export class parts{
  // frt_male = ['头部','眼部','眼部','耳朵','耳朵','鼻子','嘴巴','颈部','胸部','腹部','髋部','阴部','肩部','肩部','上臂','上臂','肘部','肘部','前臂','前臂','腕部','腕部','手掌','手掌','大腿','大腿','膝盖','膝盖','小腿','小腿','脚腕','脚腕','足部','足部'];
  // frt_female = ['头部','眼部','眼部','耳朵','耳朵','鼻子','嘴巴','颈部','胸部','乳房','腹部','髋部','阴部','肩部','肩部','上臂','上臂','肘部','肘部','前臂','前臂','腕部','腕部','手掌','手掌','大腿','大腿','膝盖','膝盖','小腿','小腿','脚腕','脚腕','足部','足部'];
  // bck = ['头部','颈部','背部','腰部','臀部','肩部','肩部','上臂','上臂','肘部','肘部','前臂','前臂','腕部','腕部','手背','手背','大腿','大腿','膝盖','膝盖','小腿','小腿','脚踝','脚踝','脚底','脚底','足部','足部'];
  frt_male = ['bp42','bp30','bp30','bp29','bp29','bp24','bp22','bp41','bp21','bp33','bp34','bp31','bp31','bp31','bp40','bp40','bp26','bp26','bp25','bp25','bp39','bp39','bp36','bp36','bp35','bp35','bp43','bp43','bp23','bp23','bp38','bp38','bp27','bp27'];
  frt_female = ['bp67','bp53','bp53','bp52','bp52','bp47','bp45','bp66','bp44','bp50','bp56','bp57','bp58','bp54','bp54','bp65','bp65','bp49','bp49','bp48','bp48','bp63','bp63','bp60','bp60','bp59','bp59','bp68','bp68','bp46','bp46','bp62','bp62','bp64','bp64'];
  bck_male = ['bp42','bp41','bp32','bp32','bp28','bp31','bp31','bp40','bp40','bp26','bp26','bp25','bp25','bp39','bp39','bp36','bp36','bp35','bp35','bp43','bp43','bp23','bp23','bp38','bp38','bp27','bp27','bp27','bp27'];
  bck_female = ['bp67','bp66','bp55','bp55','bp51','bp54','bp54','bp65','bp65','bp49','bp49','bp65','bp65','bp63','bp63','bp60','bp60','bp59','bp59','bp68','bp68','bp46','bp46','bp62','bp62','bp64','bp64','bp64','bp64'];
  frt_child = ['bp20','bp10','bp10','bp9','bp9','bp4','bp2','bp19','bp1','bp13','bp11','bp11','bp11','bp11','bp18','bp18','bp6','bp6','bp5','bp5','bp11','bp11','bp15','bp15','bp14','bp14','bp11','bp11','bp3','bp3','bp17','bp17','bp7','bp7'];
  bck_child = ['bp20','bp19','bp12','bp12','bp8','bp11','bp11','bp18','bp18','bp6','bp6','bp5','bp5','bp11','bp11','bp15','bp15','bp14','bp14','bp11','bp11','bp3','bp3','bp17','bp17','bp7','bp7','bp7','bp7'];
}
